app/controllers/widgets_controller.rb

SELECT "manufacturers".* FROM "manufacturers"
---
  def new
    @widget = Widget.new

    @manufacturers = Manufacturer.all